Scr/InformationRegisters/Прайс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Прайс</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиаметрОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиаметрДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДавлениеОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДавлениеДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОписаниеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Scr/InformationRegisters/Прайс/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеПараметров(Зап) Экспорт
	
			Стр = "";
		
		Если Зап.ДиаметрОт=0 и Зап.ДиаметрДо=0 Тогда
		//	Стр = Стр+"любой";
		ИНаче
			Стр = Стр+"Ду "+Формат(Зап.ДиаметрОт,"ЧГ=0");
			
			ЕСли Зап.ДиаметрОт=Зап.ДиаметрДо ТОгда
				
			ИначеЕсли Зап.ДиаметрДо=0 ТОгда
				Стр = Стр+" и более";
			ИНАче
				Стр = Стр+"-"+Формат(Зап.ДиаметрДо,"ЧГ=0");
			КонецЕсли;
		КонецЕСЛИ;
		
		//Стр = прав("                "+Стр,11);
		
		Если Зап.ДавлениеОт=0 и Зап.ДавлениеДо=0 Тогда
		//	Стр = Стр+"любой";
		ИНаче
			Стр = Стр+" Ру "+Формат(Зап.ДавлениеОт,"ЧГ=0");
			
			ЕСли Зап.ДавлениеОт=Зап.ДавлениеДо ТОгда
				
			ИначеЕсли Зап.ДавлениеДо=0 ТОгда
				Стр = Стр+" и более";
			ИНАче
				Стр = Стр+"-"+Формат(Зап.ДавлениеДо,"ЧГ=0");
			КонецЕсли;
		КонецЕсли;
		
		
		Возврат Стр;
		

	
КонецФункции
